# YOLOv5 ğŸš€ by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.33  # model depth multiple
width_multiple: 1.25  # layer channel multiple
anchors:
  - [7, 9,  9, 18,  17, 13]  # P3/8
  - [15, 27, 30, 19, 24, 40]  # P4/16
  - [49, 25, 39, 54, 78, 48]  # P5/32
  - [67, 96, 156, 80, 166, 173]  # P6/64

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [ [-1, 1, Conv, [64, 6, 2, 2]], # 0-P1/2                800
    [-1, 1, Conv, [ 128, 3, 2]],  # 1-P2/4                400
    [-1, 3, C3, [128]],           # 2                     400
    [-1, 1, Conv, [ 256, 3, 2]],  # 3-P3/8                200
    [-1, 6, C3, [256]],           # 4                     200
    [-1, 1, Conv, [ 512, 3, 2]],  # 5-P4/16               100
    [-1, 9, C3, [512] ],          # 6                     100
    [-1, 1, Conv, [ 768, 3, 2]],  # 7-P5/32               50
    [-1, 3, C3, [768]],           # 8                     50
    [-1, 1, Conv, [1024, 3, 2]],  # 9-P6/64               25
    [-1, 3, C3, [1024]],          # 10                    25
    [-1, 1, SPPF, [1024, 5]],     # 11                    25
  ]

# YOLOv5 v6.0 head
head:
  [ [-1, 1, Conv, [768, 1, 1]],    # 12 head                                  25
    [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 13                          50
    [[-1, 8], 1, Concat_bifpn, [960, 960]],  # 14 cat backbone P5             50
    [ -1, 3, C3, [768, False]],  # 15                                         50

    [-1, 1, Conv, [ 512, 1, 1 ] ], # 16                                       50
    [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 17                          100
    [[-1, 6], 1, Concat_bifpn, [640, 640]],  # 18 cat backbone P4             100
    [-1, 3, C3, [ 512, False ] ],  # 19                                       100

    [-1, 1, Conv, [ 256, 1, 1 ] ],  # 20                                      100
    [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 21                          200
    [[-1, 4], 1, Concat_bifpn, [320, 320]],  # 22 cat backbone P3             200
    [-1, 3, C3, [256, False]],  # 23 (P3/8-small)                             200

    [-1, 1, Conv, [512, 3, 2]], # 24                                          100
    [[-1, 6, 19], 1, Concat_bifpn, [640, 640]],  # 25 cat head P4             100
    [-1, 3, C3, [512, False ] ],  # 26 (P4/16-medium)                         100

    [-1, 1, Conv, [768, 3, 2 ] ], # 27                                        50
    [[-1, 8, 15], 1, Concat_bifpn, [960, 960]],  # 28 cat head P5             50
    [-1, 3, C3, [768, False ] ],  # 29 (P5/32-large)                          50

    [-1, 1, Conv, [1024, 3, 2]], # 30                                         25
    [ [-1, 10], 1, Concat_bifpn, [1280, 1280]],  # 31 cat head P6             25
    [ -1, 3, C3, [1024, False]],  # 32 (P6/64-xlarge)                         25
#
    [[23, 26, 29, 32], 1, Detect, [ nc, anchors ]],  # Detect(P3, P4, P5, P6)
  ]

# BIFPN garph
#
# p6     ----------------- --------Concat_bifpn----> P6(out)
#      /                  \                         \       \
#      /-------------------------------------------->
#     /                Upsample              Concat_bifpn   Concat_bifpn
#    /                    |                          \      |
# p5 ---Concat_bifpn---> head 5 ---Concat_bifpn----> P5(out)
#                        \                                  \
#                      Upsample                              Concat_bifpn
#       ----------------  | ----------------------->        /
#     /                   \                         \       \
#    /                    |                  Concat_bifpn   |
#   /                     \                          \     |
# p4 ---Concat_bifpn---> head 4 ---Concat_bifpn--->  P4(out)
#                        \                                 \
#                         ----Upsample---->                Concat_bifpn
#                                          \               /
# p3 ---Concat_bifpn------------------------------>  P3(out)