# YOLOv5 🚀 by Ultralytics, GPL-3.0 license
# imgsz 1600
# Parameters
nc: 80  # number of classes
depth_multiple: 1.33  # model depth multiple
width_multiple: 1.25  # layer channel multiple
anchors:
  - [9,13,  22,20,  19,47]  # P2/4
  - [19,27,  44,40,  38,94]  # P3/8
  - [96,68,  86,152,  180,137]  # P4/16
  - [140,301,  303,264,  238,542]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2          800
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4            400
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8            200
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16           100
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [768, 3, 2]],  # 7-P5/32           50
   [-1, 3, C3, [768]],
   [-1, 1, Conv, [1024, 3, 2]],  # 9-P6/64          25
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 11
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [768, 1, 1]],  #                   25
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  #   50
   [[-1, 8], 1, Concat_bifpn, [960,960]],  # cat backbone P5    50                    1,960, 8, 8   1,960, 8, 8
   [-1, 3, C3, [768, False]],  # 15

   [-1, 1, Conv, [512, 1, 1]],  #                   50
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  #   100
   [[-1, 6], 1, Concat_bifpn, [640,640]],  # cat backbone P4    100                   1,640,16,16   1,640,16,16
   [-1, 3, C3, [512, False]],  # 19

   [-1, 1, Conv, [256, 1, 1]],  #                   100
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  #   200
   [[-1, 4], 1, Concat_bifpn, [320,320]],  # cat backbone P3    200                   1,320,32,32   1,320,32,32
   [-1, 3, C3, [256, False]],  # 23 (P3/8-small)

   [-1, 1, Conv, [128, 1, 1]],  #                    200
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  #   400
   [[-1, 2], 1, Concat_bifpn, [160,160]],  # cat backbone P2    400                   1,160,64,64   1,160,64,64
   [-1, 3, C3, [128, False] ],  # 27 (P3/4-small)


   [-1, 1, Conv, [256, 3, 2]],  #                   200
   [[-1, 23], 1, Concat_bifpn, [320,320]], # cat head P3       200                    1,320,32,32   1,320,32,32
   [-1, 3, C3, [256, False]],  # 30 (P4/8-small)

   [-1, 1, Conv, [512, 3, 2]],  #                  100
   [[-1, 19], 1, Concat_bifpn, [640,640]],  # cat head P4      100                    1,640,16,16   1,640,16,16
   [-1, 3, C3, [512, False]],  # 33 (P5/16-medium)

   [-1, 1, Conv, [768, 3, 2]],  #                  50
   [[-1, 15], 1, Concat_bifpn, [960,960]],  # cat head P4      50                     1,960, 8, 8   1,960, 8, 8
   [-1, 3, C3, [768, False]],  # 36 (P5/32-large)
   #
   [[27, 30, 33, 36], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
