# YOLOv5 🚀 by Ultralytics, GPL-3.0 license
# imgsz 1600
# Parameters
nc: 80  # number of classes
depth_multiple: 1.33  # model depth multiple
width_multiple: 1.25  # layer channel multiple
anchors:
  - [9,13,  22,20,  19,47]  # P2/4
  - [19,27,  44,40,  38,94]  # P3/8
  - [96,68,  86,152,  180,137]  # P4/16
  - [140,301,  303,264,  238,542]  # P5/32
  - [436,615,  739,380,  925,792]  # P6/64

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2          800
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4            400
   [-1, 3, C3, [128]],          # 2                 400
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8            200
   [-1, 6, C3, [256]],          # 4                 200
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16           100
   [-1, 9, C3, [512]],          # 6                 100
   [-1, 1, Conv, [768, 3, 2]],  # 7-P5/32           50
   [-1, 3, C3, [768]],          # 8                 50
   [-1, 1, Conv, [1024, 3, 2]], # 9-P6/64           25
   [-1, 3, C3, [1024]],         # 10                25
   [-1, 1, SPPF, [1024, 5]],    # 11                25
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [768, 1, 1]],  # 12 head                               25
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 13                     50
   [[-1, 8], 1, Concat_bifpn, [960, 960]],  # 14 cat backbone P5        50
   [-1, 3, C3, [768, False]],  # 15                                     50

   [-1, 1, Conv, [512, 1, 1]],  # 16                                    50
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 17                    100
   [[-1, 6], 1, Concat_bifpn, [640, 640]],  # 18 cat backbone P4        100
   [-1, 3, C3, [512, False]],  # 19                                     100

   [-1, 1, Conv, [256, 1, 1]],  # 20                                    100
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 21                    200
   [[-1, 4], 1, Concat_bifpn, [320, 320]],  # 22 cat backbone P3        200
   [-1, 3, C3, [256, False]],  # 23 (P3/8-small)                        200

   [-1, 1, Conv, [128, 1, 1]],  # 24                                    200
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 25                    400
   [[-1, 2], 1, Concat_bifpn, [160, 160]],  # 26 cat backbone P2        400
   [-1, 3, C3, [128, False] ],  # 27 (P3/4-small)                       400

   [-1, 1, Conv, [256, 3, 2]],  # 28                                    200
   [[-1, 4, 23], 1, Concat_bifpn, [320, 320]], # 29 cat head P3         200
   [-1, 3, C3, [256, False]],  # 30 (P4/8-small)

   [-1, 1, Conv, [512, 3, 2]],  # 31                                    100
   [[-1, 6, 19], 1, Concat_bifpn, [640, 640]],  # 32 cat head P4        100
   [-1, 3, C3, [512, False]],  # 33 (P5/16-medium)                      100

   [-1, 1, Conv, [768, 3, 2]],  # 34                                    50
   [[-1, 8, 15], 1, Concat_bifpn, [960, 960]],  # 35 cat head P4        50
   [-1, 3, C3, [768, False]],  # 36 (P5/32-large)                      50

   [-1, 1, Conv, [1024, 3, 2]],  # 37                                   25
   [[-1, 10], 1, Concat_bifpn, [1280, 1280]],  # 38 cat head P6         25
   [-1, 3, C3, [1024, False]],  # 39 (P6/64-xlarge)                     25

   [[27, 30, 33, 36, 39], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5, P6)
  ]
