# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.33  # model depth multiple
width_multiple: 1.25  # layer channel multiple
anchors: 3  # AutoAnchor evolves 3 anchors per P output layer

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2                  320
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4                    160
   [-1, 3, C3, [128]],                                    # 160
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8                    80
   [-1, 6, C3, [256]],                                    # 80
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16                   40
   [-1, 9, C3, [512]],                                    # 40
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32                  20
   [-1, 3, C3, [1024]],                                   # 20
   [-1, 1, SPPF, [1024, 5]],  # 9                         # 20
  ]

# YOLOv5 v6.0 head with (P2, P3, P4, P5) outputs
head:
  [[-1, 1, Conv, [512, 1, 1]],                            # 20
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],            # 40
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4            40
   [-1, 3, C3, [512, False]],  # 13                         40

   [-1, 1, Conv, [256, 1, 1]],                            # 40
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],            # 80
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3            80
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)            80

   [-1, 1, Conv, [128, 1, 1]],                            # 80
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],            # 160
   [[-1, 2], 1, Concat, [1]],  # cat backbone P2            160
   [-1, 1, C3, [128, False]],  # 21 (P2/4-xsmall)           160

   [-1, 1, Conv, [128, 3, 2]],                            # 80
   [[-1, 18], 1, Concat, [1]],  # cat head P3               80
   [-1, 3, C3, [256, False]],  # 24 (P3/8-small)            80

   [-1, 1, Conv, [256, 3, 2]],                            # 40
   [[-1, 14], 1, Concat, [1]],  # cat head P4               40
   [-1, 3, C3, [512, False]],  # 27 (P4/16-medium)          40

   [-1, 1, Conv, [512, 3, 2]],                            # 20
   [[-1, 10], 1, Concat, [1]],  # cat head P5               20
   [-1, 3, C3, [1024, False]],  # 30 (P5/32-large)          20

   [[21, 24, 27, 30], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
