# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.33  # model depth multiple
width_multiple: 1.25  # layer channel multiple
anchors: 3  # AutoAnchor evolves 3 anchors per P output layer

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2                  320
   [-1, 1, C3, [64]],                                     # 160
   [-1, 1, Conv, [128, 3, 2]],  # 2-P2/4                    160
   [-1, 3, C3, [128]],                                    # 160
   [-1, 1, Conv, [256, 3, 2]],  # 4-P3/8                    80
   [-1, 6, C3, [256]],                                    # 80
   [-1, 1, Conv, [512, 3, 2]],  # 6-P4/16                   40
   [-1, 9, C3, [512]],                                    # 40
   [-1, 1, Conv, [1024, 3, 2]],  # 8-P5/32                  20
   [-1, 3, C3, [1024]],                                   # 20
   [-1, 1, SPPF, [1024, 5]],  # 10                        # 20
  ]

# YOLOv5 v6.0 head with (P2, P3, P4, P5) outputs
head:
  [[-1, 1, Conv, [512, 1, 1]],                            # 20
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],            # 40
   [[-1, 7], 1, Concat, [1]],  # cat backbone P4            40
   [-1, 3, C3, [512, False]],  # 14                         40

   [-1, 1, Conv, [256, 1, 1]],                            # 40
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],            # 80
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3            80
   [-1, 3, C3, [256, False]],  # 18 (P3/8-small)            80

   [-1, 1, Conv, [128, 1, 1]],                            # 80
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],            # 160
   [[-1, 3], 1, Concat, [1]],  # cat backbone P2            160
   [-1, 1, C3, [128, False]],  # 22 (P2/4-xsmall)           160

   [-1, 1, Conv, [64, 1, 1]],                             # 80
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],            # 160
   [[-1, 1], 1, Concat, [1]],  # cat backbone P1            160
   [-1, 1, C3, [128, False]],  # 26 (P1/2-xxsmall)          160


   [-1, 1, Conv, [128, 3, 2]],                            # 80
   [[-1, 23], 1, Concat, [1]],  # cat head P2               80
   [-1, 3, C3, [256, False]],  # 29 (P2/4-xsmall)           80

   [-1, 1, Conv, [256, 3, 2]],                            # 40
   [[-1, 19], 1, Concat, [1]],  # cat head P3               40
   [-1, 3, C3, [512, False]],  # 32 (P3/8-small)            40

   [-1, 1, Conv, [512, 3, 2]],                            # 20
   [[-1, 15], 1, Concat, [1]],  # cat head P4               20
   [-1, 3, C3, [1024, False]],  # 35 (P4/16)                20

   [[26, 29, 32, 35], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
