# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.33  # model depth multiple
width_multiple: 1.25  # layer channel multiple
anchors: 3  # AutoAnchor evolves 3 anchors per P output layer

# YOLOv5 v6.0 backbone
backbone:                                                 # 2880    min 18  max 364
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2                  1440
   [-1, 1, Conv, [128, 3, 2]],    # 1-P2/4                  720
   [-1, 3, C3, [128]],                                    # 720
   [-1, 1, Conv, [256, 3, 2]],    # 3-P3/8                  360     ********
   [-1, 6, C3, [256]],                                    # 360
   [-1, 1, Conv, [512, 3, 2]],    # 5-P4/16                 180
   [-1, 9, C3, [512]],                                    # 180
   [-1, 1, Conv, [768, 3, 2]],   # 7-P5/32                 90      ********
   [-1, 6, C3, [768]],                                   # 90
   [-1, 1, Conv, [1024, 3, 2]],   # 9-P6/64                 45      ********
   [-1, 3, C3, [1024]],                                   # 45
   [-1, 1, SPPF, [1024, 5]],      # 11                    # 45
  ]

# YOLOv5 v6.0 head with (P2, P3, P4, P5) outputs
head:
  [[-1, 1, Conv, [768, 1, 1]],                            # 45
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],            # 90
   [[-1, 8], 1, Concat, [1]],  # cat backbone P5            90
   [-1, 3, C3, [768, False]],  # 15                         90

   [-1, 1, Conv, [512, 1, 1]],                            # 90
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],            # 180
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4            180
   [-1, 3, C3, [52, False]],  # 19 (P4/16-small)           180

   [-1, 1, Conv, [256, 1, 1]],                            # 180
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],            # 360
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3            360
   [-1, 1, C3, [256, False]],  # 23 (P3/8-xsmall)           360

   [-1, 1, Conv, [256, 3, 2]],                            # 180
   [[-1, 20], 1, Concat, [1]],  # cat head P4               180
   [-1, 3, C3, [256, False]],  # 26 (P3/8-small)            180

   [-1, 1, Conv, [512, 3, 2]],                            # 90
   [[-1, 16], 1, Concat, [1]],  # cat head P5               90
   [-1, 3, C3, [768, False]],  # 29 (P4/16-medium)          90

   [-1, 1, Conv, [768, 3, 2]],                            # 45
   [[-1, 10], 1, Concat, [1]],  # cat head P6               45
   [-1, 3, C3, [1024, False]],  # 32 (P5/32-large)          45

   [[23, 26, 29, 32], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5, P6)
  ]
